Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# Settings_CustomKernelPathTextBox.AutomationProperties.HelpText
source: An absolute Windows path to a custom Linux kernel.
cs_cz: Absolutní cesta Windows k vlastnímu jádru Linuxu.
da_dk: En absolut Windows-sti til en brugerdefineret Linux-kerne.
de_de: Ein absoluter Windows-Pfad zu einem benutzerdefinierten Linux-Kernel.
el_gr: Μια απόλυτη διαδρομή Windows προς έναν προσαρμοσμένο πυρήνα Linux.
es_es: Ruta de acceso absoluta de Windows a un kernel de Linux personalizado.
fi_fi: Absoluuttinen Windows-polku mukautettuun Linux-ytimeen.
fr_fr: Chemin d’accès Windows absolu à un noyau Linux personnalisé.
hu_hu: Egy egyéni Linux-kernel abszolút Windows-elérési útja.
it_it: Percorso assoluto di Windows per un kernel Linux personalizzato.
ja_jp: カスタム Linux カーネルへの Windows の絶対パス。
ko_kr: 사용자 지정 Linux 커널의 절대 Windows 경로입니다.
nb_no: En absolutt Windows-bane til en egendefinert Linux-kjerne.
nl_nl: Een absoluut Windows-pad naar een aangepaste Linux-kernel.
pl_pl: Bezwzględna ścieżka systemu Windows do niestandardowego jądra systemu Linux.
pt_br: Um caminho absoluto do Windows para um kernel do Linux personalizado.
pt_pt: Um caminho absoluto do Windows para um kernel Linux personalizado.
ru_ru: Абсолютный путь Windows к собственному ядру Linux.
sv_se: En absolut Windows-sökväg till en anpassad Linux-kernel.
tr_tr: Özel bir Linux çekirdeğinin mutlak Windows yolu.
zh_cn: 自定义 Linux 内核的绝对 Windows 路径。
zh_tw: 自訂Linux核心的絕對 Windows 路徑。

# Settings_CustomKernelModulesPath.Header
source: Custom kernel modules
cs_cz: Vlastní moduly jádra
da_dk: Brugerdefineret kernemoduler
de_de: Benutzerdefinierte Kernelmodule
el_gr: Προσαρμοσμένες λειτουργικές μονάδες πυρήνα
es_es: Módulos de kernel personalizados
fi_fi: Mukautetut ydinmoduulit
fr_fr: Modules de noyau personnalisés
hu_hu: Egyedi kernelmodulok
it_it: Moduli kernel personalizzati
ja_jp: カスタム カーネル モジュール
ko_kr: 사용자 지정 커널 모듈
nb_no: Egendefinerte kjernemoduler
nl_nl: Aangepaste kernelmodules
pl_pl: Niestandardowe moduły jądra
pt_br: Personalizar módulos do kernel
pt_pt: Módulos de kernel personalizados
ru_ru: Модули настраиваемого ядра
sv_se: Anpassade kernelmoduler
tr_tr: Özel çekirdek modülleri
zh_cn: 自定义内核模块
zh_tw: 自訂核心模組

# Settings_CustomKernelModulesPath.Description
source: An absolute Windows path to a custom Linux kernel modules VHD.
cs_cz: Absolutní cesta Windows k vlastním modulům jádra VHD Linuxu.
da_dk: En absolut Windows-sti til en brugerdefineret VHD for Linux-kernemoduler.
de_de: Ein absoluter Windows-Pfad zu einer benutzerdefinierten VHD mit Linux-Kernelmodulen.
el_gr: Μια απόλυτη διαδρομή Windows προς ένα VHD προσαρμοσμένων λειτουργικών μονάδων (modules) πυρήνα Linux.
es_es: Una ruta de acceso absoluta de Windows a un VHD de módulos de kernel de Linux personalizados.
fi_fi: Absoluuttinen Windows-polku mukautettuun Linux-ydinmoduulien VHD:hen.
fr_fr: Chemin Windows absolu vers un disque dur virtuel de modules de noyau Linux personnalisés.
hu_hu: Egyéni Linux-kernel modulok virtuális merevlemezének abszolút Windows-elérési útja.
it_it: Un percorso assoluto di Windows a un VHD di moduli kernel Linux personalizzati.
ja_jp: カスタム Linux カーネル モジュール VHD への Windows 絶対パス。
ko_kr: 사용자 지정 Linux 커널 모듈 VHD에 대한 절대 Windows 경로입니다.
nb_no: En absolutt Windows-bane til modul-VHD for en egendefinert Linux-kjerne.
nl_nl: Een absoluut Windows-pad naar een aangepaste Linux-kernel modules VHD.
pl_pl: Bezwzględna ścieżka systemu Windows do niestandardowego dysku VHD modułów jądra systemu Linux.
pt_br: Um caminho absoluto do Windows para um VHD de módulos de kernel do Linux personalizados.
pt_pt: Um caminho absoluto do Windows para um VHD personalizado de módulos de kernel Linux.
ru_ru: Абсолютный путь Windows к VHD модулей настраиваемого ядра Linux.
sv_se: En absolut Windows-sökväg till en anpassad virtuell hårddisk för Linux-kernelmoduler.
tr_tr: Özel bir Linux çekirdek modülü VHD'sine giden mutlak bir Windows yolu.
zh_cn: 自定义 Linux 内核模块 VHD 的绝对 Windows 路径。
zh_tw: 自訂Linux核心模組 VHD 的絕對 Windows 路徑。

# Settings_CustomKernelModulesPathBrowseButton.Content
source: Browse kernel modules
cs_cz: Procházet moduly jádra
da_dk: Gennemse kernemoduler
de_de: Kernelmodule durchsuchen
el_gr: Αναζήτηση λειτουργικών μονάδων πυρήνα
es_es: Explorar módulos de kernel
fi_fi: Selaa ydinmoduuleja
fr_fr: Parcourir les modules de noyau
hu_hu: Kernelmodulok böngészése
it_it: Sfoglia moduli kernel
ja_jp: カーネル モジュールを参照する
ko_kr: 커널 모듈 찾아보기
nb_no: Bla gjennom kjernemoduler
nl_nl: Door kernelmodules bladeren
pl_pl: Przeglądaj moduły jądra
pt_br: Procurar módulos de kernel
pt_pt: Navegar por módulos de kernel
ru_ru: Обзор модулей ядра
sv_se: Bläddra bland kernelmoduler
tr_tr: Çekirdek modüllerine göz at
zh_cn: 浏览内核模块
zh_tw: 瀏覽核心模組

# Settings_CustomKernelModulesPathTextBox.AutomationProperties.Name
source: Custom kernel modules
cs_cz: Vlastní moduly jádra
da_dk: Brugerdefineret kernemoduler
de_de: Benutzerdefinierte Kernelmodule
el_gr: Προσαρμοσμένες λειτουργικές μονάδες πυρήνα
es_es: Módulos de kernel personalizados
fi_fi: Mukautetut ydinmoduulit
fr_fr: Modules de noyau personnalisés
hu_hu: Egyedi kernelmodulok
it_it: Moduli kernel personalizzati
ja_jp: カスタム カーネル モジュール
ko_kr: 사용자 지정 커널 모듈
nb_no: Egendefinerte kjernemoduler
nl_nl: Aangepaste kernelmodules
pl_pl: Niestandardowe moduły jądra
pt_br: Personalizar módulos do kernel
pt_pt: Módulos de kernel personalizados
ru_ru: Модули настраиваемого ядра
sv_se: Anpassade kernelmoduler
tr_tr: Özel çekirdek modülleri
zh_cn: 自定义内核模块
zh_tw: 自訂核心模組

# Settings_CustomKernelModulesPathTextBox.AutomationProperties.HelpText
source: An absolute Windows path to a custom Linux kernel modules VHD.
cs_cz: Absolutní cesta Windows k vlastním modulům jádra VHD Linuxu.
da_dk: En absolut Windows-sti til en brugerdefineret VHD for Linux-kernemoduler.
de_de: Ein absoluter Windows-Pfad zu einer benutzerdefinierten VHD mit Linux-Kernelmodulen.
el_gr: Μια απόλυτη διαδρομή Windows προς ένα VHD προσαρμοσμένων λειτουργικών μονάδων (modules) πυρήνα Linux.
es_es: Una ruta de acceso absoluta de Windows a un VHD de módulos de kernel de Linux personalizados.
fi_fi: Absoluuttinen Windows-polku mukautettuun Linux-ydinmoduulien VHD:hen.
fr_fr: Chemin Windows absolu vers un disque dur virtuel de modules de noyau Linux personnalisés.
hu_hu: Egyéni Linux-kernel modulok virtuális merevlemezének abszolút Windows-elérési útja.
it_it: Un percorso assoluto di Windows a un VHD di moduli kernel Linux personalizzati.
ja_jp: カスタム Linux カーネル モジュール VHD への Windows 絶対パス。
ko_kr: 사용자 지정 Linux 커널 모듈 VHD에 대한 절대 Windows 경로입니다.
nb_no: En absolutt Windows-bane til modul-VHD for en egendefinert Linux-kjerne.
nl_nl: Een absoluut Windows-pad naar een aangepaste Linux-kernel modules VHD.
pl_pl: Bezwzględna ścieżka systemu Windows do niestandardowego dysku VHD modułów jądra systemu Linux.
pt_br: Um caminho absoluto do Windows para um VHD de módulos de kernel do Linux personalizados.
pt_pt: Um caminho absoluto do Windows para um VHD personalizado de módulos de kernel Linux.
ru_ru: Абсолютный путь Windows к VHD модулей настраиваемого ядра Linux.
sv_se: En absolut Windows-sökväg till en anpassad virtuell hårddisk för Linux-kernelmoduler.
tr_tr: Özel bir Linux çekirdek modülü VHD'sine giden mutlak bir Windows yolu.
zh_cn: 自定义 Linux 内核模块 VHD 的绝对 Windows 路径。
zh_tw: 自訂Linux核心模組 VHD 的絕對 Windows 路徑。

# Settings_CustomSystemDistroPath.Header
source: Custom system distro
cs_cz: Vlastní distribuce systému
da_dk: Distribution af brugerdefineret system
de_de: Benutzerdefinierte Systemverteiler
el_gr: Προσαρμοσμένη διανομή συστήματος
es_es: Pulsación del sistema personalizada
fi_fi: Mukautettu järjestelmän distro
fr_fr: Distribution système personnalisée
hu_hu: Egyéni rendszer disztribúciója
it_it: Distribuzione di sistema personalizzata
ja_jp: カスタム システム ディストリビューション
ko_kr: 사용자 지정 시스템 배포판
nb_no: Egendefinert systemdeaktivering
nl_nl: Aangepaste systeemdistributie
pl_pl: Niestandardowa dystrybucja systemu
pt_br: Distribuição de sistema personalizada
pt_pt: Distribuição do sistema personalizado
ru_ru: Пользовательский системный дистрибутив
sv_se: Distribution av anpassat system
tr_tr: Özel sistem dağıtımı
zh_cn: 自定义系统发行版
zh_tw: 自訂系統發行版

# Settings_CustomSystemDistroPathBrowseButton.Content
source: Browse distros
cs_cz: Procházet distribuce
da_dk: Gennemse distributioner
de_de: Distributionen durchsuchen
el_gr: Αναζήτηση διανομών
es_es: Examinar distribuciones
fi_fi: Selaa distroja
fr_fr: Parcourir les distributions
hu_hu: Böngészés a disztribúciók között
it_it: Esplora distribuzioni
ja_jp: ディストリビューションの参照
ko_kr: 배포판 찾아보기
nb_no: Bla gjennom distroer
nl_nl: Bladeren door distro's
pl_pl: Przeglądaj dystrybucje
pt_br: Procurar distros
pt_pt: Procurar distros.
ru_ru: Обзор дистрибутивов
sv_se: Bläddra bland distributioner
tr_tr: Dağıtımlara gözat
zh_cn: 浏览发行版
zh_tw: 瀏覽發行套件

# Settings_CustomSystemDistroPathDescription.Text
source: Specify a path to a VHD which will load as a custom system distro, primarily used to power GUI apps in WSL. [Learn more about system distros here].
cs_cz: Určete cestu k virtuálnímu pevnému disku, který se načte jako vlastní distribuce systému a primárně se použije používá k napájení aplikací s grafickým uživatelským rozhraním ve WSL. [Další informace o distribucích systému najdete tady].
da_dk: Angiv en sti til en VHD, der indlæses som en brugerdefineret system distro, der primært bruges til at styrke GUI-apps i WSL. [Få mere at vide om system distros her].
de_de: Geben Sie einen Pfad zu einer VHD an, die als benutzerdefinierte Systemdistribution geladen wird, die in erster Linie zum Betrieb von GUI-Anwendungen in der WSL verwendet wird. [Weitere Informationen zu Systemverteilern finden Sie hier].
el_gr: Καθορίστε μια διαδρομή προς ένα VHD το οποίο θα φορτωθεί ως προσαρμοσμένη διανομή συστήματος, και χρησιμοποιείται κυρίως για την τροφοδοσία εφαρμογών GUI στο WSL. [Μάθετε περισσότερα για τις διανομές συστήματος εδώ].
es_es: Especifique una ruta de acceso a un VHD que se cargará como una pulsación del sistema personalizada, que se usa principalmente para encender aplicaciones GUI en WSL. [Obtenga más información sobre las distribuciones del sistema aquí].
fi_fi: Määritä polku VHD-levylle, joka ladataan mukautettuna järjestelmädistrona, jota käytetään ensisijaisesti WSL:n GUI-sovellusten käyttämiseen. [Lisätietoja järjestelmädistroista täältä].
fr_fr: Indiquez le chemin d'accès à un VHD qui sera chargé en tant que distribution système personnalisée, principalement utilisée pour alimenter les applications GUI dans WSL. [Pour en savoir plus sur les distributions système, cliquez ici].
hu_hu: Adja meg egy olyan VHD elérési útját, amely egyéni rendszer-disztribúcióként lesz betöltve, amelyet elsősorban a WSL grafikus felhasználói felületi alkalmazásaihoz használnak. [További információ a rendszer disztribúcióiról itt].
it_it: Specificare un percorso di un disco rigido virtuale che verrà caricato come distribuzione personalizzata del sistema, usato principalmente per l'alimentazione delle app GUI in WSL. [Altre informazioni sulle distribuzioni di sistema sono disponibili qui].
ja_jp: カスタム システム ディストリビューションとして読み込む VHD へのパスを指定します。このパスは、主に WSL の GUI アプリを強化するために使用されます。[システム ディストリビューションの詳細については、こちらを参照してください]。
ko_kr: 사용자 지정 시스템 배포판으로 로드되는 VHD의 경로를 지정합니다. 주로 WSL에서 GUI 앱을 제공하는 데 사용됩니다. [] 여기서 시스템 배포판에 대해 자세히 알아보세요.
nb_no: Angi en bane til en VHD som lastes inn som en egendefinert systemdeaktivering, først og fremst brukt til å drive GUI-apper i WSL. [Mer informasjon om systemdespsjoner her].
nl_nl: Geef een pad op naar een VHD die wordt geladen als een aangepaste systeemdistributie, die voornamelijk wordt gebruikt om GUI-apps in WSL aan te zetten. [Meer informatie over systeemdistributies hier].
pl_pl: Określ ścieżkę do dysku VHD, który będzie ładowany jako niestandardowa dystrybucja systemu, używana głównie do obsługi aplikacji graficznego interfejsu użytkownika w podsystemie WSL. [Dowiedz się więcej o dystrybucji systemu tutaj].
pt_br: Especifique um caminho para um VHD que será carregado como uma distribuição personalizada do sistema, usado principalmente para ativar aplicativos gui no WSL. [saiba mais sobre distros do sistema aqui].
pt_pt: Especifique um caminho para um VHD que será carregado como distro de sistema personalizado, utilizado principalmente para alimentar aplicações GUI no WSL. [Saiba mais sobre as distros do sistema aqui].
ru_ru: Укажите путь к виртуальному жесткому диску, который будет загружаться как пользовательский системный дистрибутив, в основном используемый для работы приложений с графическим интерфейсом в WSL. [Подробнее о системных дистрибутивах можно узнать здесь].
sv_se: Ange en sökväg till en virtuell hårddisk som ska läsas in som en anpassad systemdistro, främst för att driva GUI-appar i WSL. [Läs mer om systemdistros här].
tr_tr: Öncelikle WSL'deki GUI uygulamalarına güç sağlamak için kullanılan özel bir sistem dağıtımı olarak yüklenecek bir VHD'ye giden yolu belirtin. [Buradan sistem dağıtımları hakkında daha fazla bilgi edinin].
zh_cn: 指定一个 VHD 路径，该 VHD 将作为自定义系统发行版加载，主要用于在 WSL 中运行 GUI 应用。[在此处详细了解系统发行]。
zh_tw: 指定要載入為自訂系統發行版的 VHD 路徑，主要用於在 WSL 中啟用 GUI 應用程式。[在此深入了解系統發行]。

# Settings_CustomSystemDistroPathTextBox.AutomationProperties.Name
source: Custom system distro
cs_cz: Vlastní distribuce systému
da_dk: Distribution af brugerdefineret system
de_de: Benutzerdefinierte Systemverteiler
el_gr: Προσαρμοσμένη διανομή συστήματος
es_es: Pulsación del sistema personalizada
fi_fi: Mukautettu järjestelmän distro
fr_fr: Distribution système personnalisée
hu_hu: Egyéni rendszer disztribúciója
it_it: Distribuzione di sistema personalizzata
ja_jp: カスタム システム ディストリビューション
ko_kr: 사용자 지정 시스템 배포판
nb_no: Egendefinert systemdeaktivering
nl_nl: Aangepaste systeemdistributie
pl_pl: Niestandardowa dystrybucja systemu
pt_br: Distribuição de sistema personalizada
pt_pt: Distribuição do sistema personalizado
ru_ru: Пользовательский системный дистрибутив
sv_se: Distribution av anpassat system
tr_tr: Özel sistem dağıtımı
zh_cn: 自定义系统发行版
zh_tw: 自訂系統發行版

# Settings_CustomSystemDistroPathTextBox.AutomationProperties.HelpText
source: Specify a path to a VHD which will load as a custom system distro, primarily used to power GUI apps in WSL.
cs_cz: Určete cestu k virtuálnímu pevnému disku, který se načte jako vlastní distribuce systému a primárně se použije používá k napájení aplikací s grafickým uživatelským rozhraním ve WSL.
da_dk: Angiv en sti til en VHD, der indlæses som en brugerdefineret system distro, der primært bruges til at styrke GUI-apps i WSL.
de_de: Geben Sie einen Pfad zu einer VHD an, die als benutzerdefinierte Systemdistribution geladen wird, die hauptsächlich zum Betreiben von GUI-Apps in WSL verwendet wird.
el_gr: Καθορίστε μια διαδρομή προς ένα VHD το οποίο θα φορτωθεί ως προσαρμοσμένη διανομή συστήματος, και χρησιμοποιείται κυρίως για την τροφοδοσία εφαρμογών GUI στο WSL.
es_es: Especifique una ruta de acceso a un VHD que se cargará como una pulsación del sistema personalizada, que se usa principalmente para encender aplicaciones GUI en WSL.
fi_fi: Määritä polku VHD-levylle, joka ladataan mukautettuna järjestelmädistrona, jota käytetään ensisijaisesti WSL:n GUI-sovellusten käyttämiseen.
fr_fr: Spécifiez un chemin d’accès à un disque dur virtuel qui sera chargé en tant que distribution système personnalisée, principalement utilisée pour alimenter les applications GUI dans WSL.
hu_hu: Adja meg egy olyan VHD elérési útját, amely egyéni rendszer-disztribúcióként lesz betöltve, amelyet elsősorban a WSL grafikus felhasználói felületi alkalmazásaihoz használnak.
it_it: Specificare un percorso di un disco rigido virtuale che verrà caricato come distribuzione personalizzata del sistema, usato principalmente per l'alimentazione delle app GUI in WSL.
ja_jp: カスタム システム ディストリビューションとして読み込む VHD へのパスを指定します。このパスは、主に WSL の GUI アプリを強化するために使用されます。
ko_kr: WSL에서 주로 GUI 앱 구동에 사용하는 사용자 지정 시스템 배포판으로 로드할 VHD의 경로를 지정합니다.
nb_no: Angi en bane til en VHD som lastes inn som en egendefinert systemdistro, hovedsakelig brukt til å drive GUI-apper i WSL.
nl_nl: Geef een pad op naar een VHD die wordt geladen als een aangepaste systeemdistributie, die voornamelijk wordt gebruikt om GUI-apps in WSL aan te zetten.
pl_pl: Określ ścieżkę do wirtualnego dysku twardego, który będzie ładowany jako niestandardowa dystrybucja systemu, używana głównie do obsługi aplikacji graficznego interfejsu użytkownika w podsystemie WSL.
pt_br: Especifique um caminho para um VHD que será carregado como uma distribuição personalizada do sistema, usado principalmente para ativar aplicativos gui no WSL.
pt_pt: Especifique um caminho para um VHD que será carregado como distro de sistema personalizado, utilizado principalmente para alimentar aplicações GUI no WSL.
ru_ru: Укажите путь к VHD, который будет загружаться как пользовательский системный дистрибутив, который в основном используется для работы приложений с графическим интерфейсом в WSL.
sv_se: Ange en sökväg till en virtuell hårddisk som ska läsas in som en anpassad systemdistro, främst för att driva GUI-appar i WSL.
tr_tr: Öncelikli olarak WSL'deki GUI uygulamalarına güç sağlamak için kullanılan özel bir sistem dağıtımı şeklinde yüklenecek VHD'ye giden yolu belirtin.
zh_cn: 指定一个 VHD 路径，该 VHD 将作为自定义系统发行版加载，主要用于在 WSL 中运行 GUI 应用。
zh_tw: 指定要載入為自訂系統發行版的 VHD 路徑，主要用於在 WSL 中啟用 GUI 應用程式。

# Settings_DebugConsole.Header
source: Enable debug console
cs_cz: Povolit konzolu ladění
da_dk: Aktivér fejlfindingskonsol
de_de: Aktivieren der Debugkonsole
el_gr: Ενεργοποίηση κονσόλας εντοπισμού σφαλμάτων
es_es: Habilitar consola de depuración
fi_fi: Ota virheenkorjauskonsoli käyttöön
fr_fr: Activer la console de débogage
hu_hu: Hibakeresési konzol engedélyezése
it_it: Abilita la console di debug
ja_jp: デバッグ コンソールを有効にする
ko_kr: 디버그 콘솔 사용
nb_no: Aktiver feilsøkingskonsoll
nl_nl: Foutopsporingsconsole inschakelen
pl_pl: Włącz konsolę debugowania
pt_br: Habilitar console de depuração
pt_pt: Ativar consola de depuração
ru_ru: Включить консоль отладки
sv_se: Aktivera felsökningskonsol
tr_tr: Hata ayıklama konsolunu etkinleştir
zh_cn: 启用调试控制台
zh_tw: 啟用偵錯主控台

# Settings_DebugConsole.Description
source: Boolean to turn on an output console window that shows the contents of dmesg upon start of a WSL 2 distro instance.
cs_cz: Logická hodnota pro zapnutí okna výstupní konzoly, které zobrazuje obsah dmesg při spuštění instance distribuce WSL 2.
da_dk: Boolesk værdi til at aktivere et outputkonsolvindue, der viser indholdet af dmesg ved start af en WSL 2-distroforekomst.
de_de: Boolescher Wert zum Aktivieren eines Ausgabekonsolenfensters, das den Inhalt von „dmesg“ beim Start einer WSL 2-Verteilerinstanz anzeigt.
el_gr: Τιμή boolean για την ενεργοποίηση ενός παραθύρου κονσόλας εξόδου που εμφανίζει τα περιεχόμενα του dmesg κατά την εκκίνηση μιας παρουσίας διανομής WSL 2.
es_es: Booleano para activar una ventana de consola de salida que muestra el contenido de dmesg al iniciar una instancia de distribución de WSL 2.
fi_fi: Totuusarvo, joka ottaa käyttöön tulostuskonsolin ikkunan, joka näyttää dmesg:n sisällön WSL 2 -distro-esiintymän käynnistyksen yhteydessä.
fr_fr: Valeur booléenne permettant d’activer une fenêtre de console de sortie qui affiche le contenu de dmesg au démarrage d’une instance de distribution WSL 2.
hu_hu: Logikai érték egy kimeneti konzolablak bekapcsolásához, amely megjeleníti a dmesg tartalmát egy WSL 2 disztribúciós példány indításakor.
it_it: Valore booleano per attivare una finestra della console di output che mostra il contenuto di dmesg all'inizio di un'istanza di distribuzione WSL 2.
ja_jp: WSL 2 ディストリビューション インスタンスの開始時に、dmesg の内容を表示する出力コンソール ウィンドウを有効にするブール値。
ko_kr: WSL 2 배포판 인스턴스가 시작될 때 dmesg의 내용을 표시하는 출력 콘솔 창을 켜는 부울입니다.
nb_no: Boolsk for å aktivere et utdatakonsollvindu som viser innholdet i dmesg ved starten av en WSL 2-utgående forekomst.
nl_nl: Booleaanse waarde voor het inschakelen van een uitvoerconsolevenster waarin de inhoud van dmesg wordt weergegeven bij het begin van een WSL 2-distributie-exemplaar.
pl_pl: Wartość logiczna umożliwiająca włączenie okna konsoli wyjściowej, które wyświetla zawartość środowiska dmesg po uruchomieniu wystąpienia dystrybucji podsystemu WSL 2.
pt_br: Booliano para ativar uma janela do console de saída que mostra o conteúdo do dmesg no início de uma instância de distribuição WSL 2.
pt_pt: Valores booleanos para ativar uma janela de consola de saída que mostra o conteúdo do dmesg no início de uma instância da distribuição WSL 2.
ru_ru: Логическое значение для включения окна вывода консоли, в котором отображается содержимое dmesg при запуске экземпляра дистрибутива WSL 2.е dmesg при запуске экземпляра дистрибутива WSL 2.
sv_se: Booleskt värde för att aktivera ett utdatakonsolfönster som visar innehållet i dmesg när en WSL 2-distributionsinstans startas.
tr_tr: WSL 2 dağıtım örneği başlatıldığında dmesg içeriğini gösteren bir konsol penceresi çıktısını açan boole değeri.
zh_cn: 用于打开输出控制台窗口的布尔值，该窗口在 WSL 2 发行版实例启动时显示 dmesg 的内容。
zh_tw: 布林值，可開啟輸出控制台視窗，該視窗會在啟動 WSL 2 發行版執行個體時顯示 dmesg 的內容。

# Settings_DebugConsoleToggleSwitch.AutomationProperties.Name
source: Enable debug console.
cs_cz: Povolte konzoli ladění.
da_dk: Aktivér fejlfindingskonsol.
de_de: Aktivieren der Debugkonsole.
el_gr: Ενεργοποίηση κονσόλας εντοπισμού σφαλμάτων.
es_es: Habilitar consola de depuración.
fi_fi: Ota virheenkorjauskonsoli käyttöön.
fr_fr: Activez la console de débogage.
hu_hu: Hibakeresési konzol engedélyezése.
it_it: Abilita la console di debug.
ja_jp: デバッグ コンソールを有効にします。
ko_kr: 디버그 콘솔을 사용하도록 설정합니다.
nb_no: Aktiver feilsøkingskonsoll.
nl_nl: Foutopsporingsconsole inschakelen.
pl_pl: Włącz konsolę debugowania.
pt_br: Habilitar console de depuração.
pt_pt: Ativar consola de depuração.
ru_ru: Включить консоль отладки.
sv_se: Aktivera felsökningskonsol.
tr_tr: Hata ayıklama konsolunu etkinleştirin.
zh_cn: 启用调试控制台。
zh_tw: 啟用偵錯主控台。
